{"modelTopology":{"node":[{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"6"}]}}},"dtype":{"type":1}},"name":"agent0/ppo2_model/pi/b","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"},{"size":"6"}]}}}},"name":"agent0/ppo2_model/pi/w","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}}},"name":"agent0/ppo2_model/pi/dense_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"agent0/ppo2_model/pi/dense_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"agent0/ppo2_model/pi/dense_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"agent0/ppo2_model/pi/dense_1/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}}},"name":"agent0/ppo2_model/pi/dense/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"525"},{"size":"64"}]}}}},"name":"agent0/ppo2_model/pi/dense/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"2"}]}}}},"name":"agent0/ppo2_model/pi/flatten/Reshape/shape","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"25"}]}}},"dtype":{"type":1}},"name":"agent0/ppo2_model/pi/conv_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"25"},{"size":"25"}]}}},"dtype":{"type":1}},"name":"agent0/ppo2_model/pi/conv_1/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"25"}]}}}},"name":"agent0/ppo2_model/pi/conv_0/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"25"},{"size":"25"}]}}},"dtype":{"type":1}},"name":"agent0/ppo2_model/pi/conv_0/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"25"}]}}},"dtype":{"type":1}},"name":"agent0/ppo2_model/pi/conv_initial/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"5"},{"size":"5"},{"size":"20"},{"size":"25"}]}}}},"name":"agent0/ppo2_model/pi/conv_initial/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"shape":{"shape":{"dim":[{"size":"30"},{"size":"9"},{"size":"5"},{"size":"20"}]}}},"name":"agent0/ppo2_model/Ob","op":"Placeholder"},{"input":["agent0/ppo2_model/Ob","agent0/ppo2_model/pi/conv_initial/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"agent0/ppo2_model/pi/conv_initial/Conv2D","op":"Conv2D"},{"input":["agent0/ppo2_model/pi/conv_initial/Conv2D","agent0/ppo2_model/pi/conv_initial/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"agent0/ppo2_model/pi/conv_initial/BiasAdd","op":"BiasAdd"},{"input":["agent0/ppo2_model/pi/conv_initial/BiasAdd"],"attr":{"T":{"type":1},"alpha":{"f":0.20000000298023224}},"name":"agent0/ppo2_model/pi/conv_initial/LeakyRelu","op":"LeakyRelu"},{"input":["agent0/ppo2_model/pi/conv_initial/LeakyRelu","agent0/ppo2_model/pi/conv_0/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[83,65,77,69]}},"name":"agent0/ppo2_model/pi/conv_0/Conv2D","op":"Conv2D"},{"input":["agent0/ppo2_model/pi/conv_0/Conv2D","agent0/ppo2_model/pi/conv_0/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"agent0/ppo2_model/pi/conv_0/BiasAdd","op":"BiasAdd"},{"input":["agent0/ppo2_model/pi/conv_0/BiasAdd"],"attr":{"T":{"type":1},"alpha":{"f":0.20000000298023224}},"name":"agent0/ppo2_model/pi/conv_0/LeakyRelu","op":"LeakyRelu"},{"input":["agent0/ppo2_model/pi/conv_0/LeakyRelu","agent0/ppo2_model/pi/conv_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"agent0/ppo2_model/pi/conv_1/Conv2D","op":"Conv2D"},{"input":["agent0/ppo2_model/pi/conv_1/Conv2D","agent0/ppo2_model/pi/conv_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"agent0/ppo2_model/pi/conv_1/BiasAdd","op":"BiasAdd"},{"input":["agent0/ppo2_model/pi/conv_1/BiasAdd"],"attr":{"T":{"type":1},"alpha":{"f":0.20000000298023224}},"name":"agent0/ppo2_model/pi/conv_1/LeakyRelu","op":"LeakyRelu"},{"input":["agent0/ppo2_model/pi/conv_1/LeakyRelu","agent0/ppo2_model/pi/flatten/Reshape/shape"],"attr":{"T":{"type":1},"Tshape":{"type":3}},"name":"agent0/ppo2_model/pi/flatten/Reshape","op":"Reshape"},{"input":["agent0/ppo2_model/pi/flatten/Reshape","agent0/ppo2_model/pi/dense/kernel"],"attr":{"T":{"type":1},"transpose_a":{"b":false},"transpose_b":{"b":false}},"name":"agent0/ppo2_model/pi/dense/MatMul","op":"MatMul"},{"input":["agent0/ppo2_model/pi/dense/MatMul","agent0/ppo2_model/pi/dense/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"agent0/ppo2_model/pi/dense/BiasAdd","op":"BiasAdd"},{"input":["agent0/ppo2_model/pi/dense/BiasAdd"],"attr":{"alpha":{"f":0.20000000298023224},"T":{"type":1}},"name":"agent0/ppo2_model/pi/dense/LeakyRelu","op":"LeakyRelu"},{"input":["agent0/ppo2_model/pi/dense/LeakyRelu","agent0/ppo2_model/pi/dense_1/kernel"],"attr":{"T":{"type":1},"transpose_a":{"b":false},"transpose_b":{"b":false}},"name":"agent0/ppo2_model/pi/dense_1/MatMul","op":"MatMul"},{"input":["agent0/ppo2_model/pi/dense_1/MatMul","agent0/ppo2_model/pi/dense_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"agent0/ppo2_model/pi/dense_1/BiasAdd","op":"BiasAdd"},{"input":["agent0/ppo2_model/pi/dense_1/BiasAdd"],"attr":{"T":{"type":1},"alpha":{"f":0.20000000298023224}},"name":"agent0/ppo2_model/pi/dense_1/LeakyRelu","op":"LeakyRelu"},{"input":["agent0/ppo2_model/pi/dense_1/LeakyRelu","agent0/ppo2_model/pi/dense_2/kernel"],"attr":{"transpose_b":{"b":false},"T":{"type":1},"transpose_a":{"b":false}},"name":"agent0/ppo2_model/pi/dense_2/MatMul","op":"MatMul"},{"input":["agent0/ppo2_model/pi/dense_2/MatMul","agent0/ppo2_model/pi/dense_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"agent0/ppo2_model/pi/dense_2/BiasAdd","op":"BiasAdd"},{"input":["agent0/ppo2_model/pi/dense_2/BiasAdd"],"attr":{"alpha":{"f":0.20000000298023224},"T":{"type":1}},"name":"agent0/ppo2_model/pi/dense_2/LeakyRelu","op":"LeakyRelu"},{"input":["agent0/ppo2_model/pi/dense_2/LeakyRelu","agent0/ppo2_model/pi/w"],"attr":{"T":{"type":1},"transpose_a":{"b":false},"transpose_b":{"b":false}},"name":"agent0/ppo2_model/pi_1/MatMul","op":"MatMul"},{"input":["agent0/ppo2_model/pi_1/MatMul","agent0/ppo2_model/pi/b"],"attr":{"T":{"type":1}},"name":"agent0/ppo2_model/pi_1/add","op":"Add"},{"input":["agent0/ppo2_model/pi_1/add"],"attr":{"T":{"type":1}},"name":"agent0/ppo2_model/Softmax","op":"Softmax"},{"input":["agent0/ppo2_model/Softmax"],"attr":{"T":{"type":1}},"name":"agent0/ppo2_model/action_probs","op":"Identity"}],"library":{"function":[],"gradient":[]},"versions":{"badConsumers":[]}},"weightsManifest":[{"paths":["group1-shard1of1"],"weights":[{"name":"agent0/ppo2_model/pi/b","shape":[6],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/w","shape":[64,6],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/dense_2/bias","shape":[64],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/dense_2/kernel","shape":[64,64],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/dense_1/bias","shape":[64],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/dense_1/kernel","shape":[64,64],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/dense/bias","shape":[64],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/dense/kernel","shape":[525,64],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/flatten/Reshape/shape","shape":[2],"dtype":"int32"},{"name":"agent0/ppo2_model/pi/conv_1/bias","shape":[25],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/conv_1/kernel","shape":[3,3,25,25],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/conv_0/bias","shape":[25],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/conv_0/kernel","shape":[3,3,25,25],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/conv_initial/bias","shape":[25],"dtype":"float32"},{"name":"agent0/ppo2_model/pi/conv_initial/kernel","shape":[5,5,20,25],"dtype":"float32"}]}]}